app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "email", "kind_id", "name", "rmk", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-02-13 02:28:33.671959"], ["email", "manucaso@email.com"], ["kind_id", 2], ["name", "Manoel Soares"], ["rmk", "dsljdsjld"], ["updated_at", "2018-02-13 02:28:33.671959"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "email" = ?, "updated_at" = ? WHERE "contacts"."id" = 3  [["email", "violagol@santos.com"], ["updated_at", "2018-02-13 02:42:45.192932"]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)