app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index                   #nome do arquivo     #controler é o nome da pastas
    @kinds = Kind.all               #select "kinds".* from "kinds"

INSERT INTO "kinds" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2018-02-12 21:15:59.516988"], ["description", "Amigo"], ["updated_at", "2018-02-12 21:15:59.516988"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

UPDATE "kinds" SET "description" = ?, "updated_at" = ? WHERE "kinds"."id" = 1  [["description", "Amigoo"], ["updated_at", "2018-02-12 21:17:10.370023"]]
---
  def update
    respond_to do |format|
      if @kind.update(kind_params)